{
  "date": "2023-06-14T03:14:00.000Z",
  "excerpt": "Opowiadanie.",
  "html": "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\">\n<html>\n<head>\n\t<meta http-equiv=\"content-type\" content=\"text/html; charset=windows-1250\"/>\n\t<title></title>\n\t<meta name=\"generator\" content=\"LibreOffice 6.1.0.3 (Windows)\"/>\n\t<meta name=\"created\" content=\"2016-08-08T21:48:28.379448969\"/>\n\t<meta name=\"changed\" content=\"2017-12-28T14:58:51.395000000\"/>\n\t<style type=\"text/css\">\n\t\t@page { size: 21cm 29.7cm; margin: 2cm }\n\t\tp { margin-bottom: 0.25cm; line-height: 120%; background: transparent }\n\t</style>\n</head>\n<body lang=\"pl-PL\" link=\"#000080\" vlink=\"#800000\" dir=\"ltr\"><p align=\"center\" style=\"margin-bottom: 0cm; line-height: 100%\">\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">\nMirosław Leśniak</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">6 lat</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tTryskająca\nłzami rozpacz. Taka była Reakcja Mal na pierwszy dzień szkoły.\nBudziło to politowanie u dorosłych którzy nie bacząc na łzy\nzaciągnęli go do budy. Po początkowym pochlipiwaniu Mal\nbezemocjonalnie zaczął doświadczać edukacji. Powrót do domu,\nkolacja, telewizja, higiena, sen. \n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tPrzyszedł\nkolejny dzień, Mal obojętnie udał się do szkoły w towarzystwie\nwłaśnie co poznanych współuczniów. Wymienili kilka zdań,\nzaczęły się lekcje. Na jednej ze przerw podleciało do niego kilku\nnieznanych chłopców. Mal nie mógł zrozumieć dlaczego właśnie\nkopnięto go w krocze przy akompaniamencie wulgarnych wyzwisk. Nigdy\nsię na to nie skarżył.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tKoniec\nlekcji. Mal rozwinął skrzydła i wraz z innymi chłopcami udali się\nw kierunku ich domów. Tym razem mieli ze sobą ciężkie torby\nwypełnione książkami. Nigdy do tego nie przywyknie. Pierwsze\nzadania domowe pod uważnym okiem rodziców. Kolacja, telewizja,\nhigiena, sen.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tPierwszy\nweekend wolny od szkoły. Z pasją budował przeróżne konstrukcje z\nklocków, zaczytywał się w niepoprawnych magazynach z\nhumorem i kiczowatych gazetach o grach komputerowych, malowaniem. W\npokoju siostry naprzemiennie panowały muzyka z ciszą. Brat był w\nwojsku.</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">* * *</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tWaniliowy\nserek homogenizowany i świeża bułka. Nie było lepszego śniadania.\nDo tego kubek ciepłego kakao. Mama dbała o to aby dzieci były\nprzygotowane do szkoły. Sama pracowała wtedy w innej placówce\noświaty. Ojciec cały dzień handlował częściami do rydwanów.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tNastała\nzima, loty do szkoły rankiem musiały odbywać się w mroku. Powroty\nrównież nie przebiegały w blasku słońca. W domu tym razem było\ninaczej. Kiedy Mal wrócił ze szkoły nie zastał mamy ale ojca i\njednego z jego kolegów. Prowadzili rozmowę, nie wiedział o czym.\nOjciec nakazał iść do pokoju po czym nalał coś z butelki. Mal\nzajął się swoimi sprawami w pokoju. Zabawą, lekturą i zadaniami\ndomowymi. \n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tZadania\ndomowe. Nienawidził ich. Zmuszano go do wykonywania tej czynności.\nOdrywały go od tego co kochał. Szybko zaczął prób oszukania\nkażdego który go do nich zmuszał. Robił wszystko żeby nie\nzaglądać do podręczników. Zabierały cenny czas którego było\ntak mało po szkole.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tSzkoła\nnie była taka zła, okazało się, że pomimo kilku dręczycieli\nmożna tam zwyczajnie robić jaja. Niestety wiązało się to z\ndezaprobatą czerwonych nauczycieli którzy skrupulatnie wpisywali\nuwagi do dzienników lub, w ramach kary, wzywali do tablicy co\nkończyło się nagannym. Przecież w klasie musiał panować ład i\nporządek a dzieci musiały się uczyć. \n</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">* * *</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tBył\nrok AD1995. Wszystko co działo się do tej pory działo się nadal,\njedynie w bardziej zaawansowanej formie. Był piątek trzynastego,\nMal wylądował na progu swojego domu. Otworzył drzwi do mieszkania,\nwszedł prosto do swojego pokoju, rzucił ciążącą mu torbę na\npodłogę. Wpadł w lekki szok. Zauważył, że na jego biurku\nspoczywają komponenty komputera. Wyzwoliło to ekscytację. Nie\nwiedział jak to uruchomić, jednak, jeden z jego kolegów miał\nkomputer od dłuższego czasu i znał informatyka. Mal poprosił ojca\naby do niego zadzwonił. Wieczorem ta jednooka menda była już u\nnich w mieszkaniu.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tJednooki\nzamknął się w pokoju na dwie godziny i kazał nie przeszkadzać.\nPo upływie tego czasu komp był sprawny DOOS i Winblows 3.11\ndziałały. Menda kazała zapłacić za usługę oraz gry i zniknęła\nw mroku nocy.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tPuntium\n75, 8MB pamięci, Dysk 1GB, stacja dyskietek 1.44MB, karta SVGA. Brak\ndźwiękówki czy CD-ROM na tamtą chwilę. Za każdym razem kiedy\nwpisywał błędne polecenie w DOOS system odpowiadał „co robisz\nidioto?”. Słodkie. Przynajmniej magicznie pojawiło się tam\nwiele ciekawych gier.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">* * *</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tNikt\nnie wpadł na to aby uczyć mal powiedzmy programowania. Od nauki\nbyła szkoła a tam nie było informatyki. Informatyka byłą na\nulicy. Latali od mieszkania do mieszkania. Każdy dzierżył paczkę\ndyskietek. Program rar w niebieskim interfejsie umożliwiał\npakowanie i dzielenie danych na paczki pozwalające na transport na\ndyskietkach 1.44MB. Było dzięki temu w co grać. Królowały wtedy\nDom, Wurcraft 2, Moortal Koombat i inne. Warms+ też był niczego\nsobie. Mal zagrywał się w domu kiedy mógł. Grał. I grał.\nNajczęściej sam. Bo spotkania z kolegami na podwórku kończyły\nsię różnymi formami przemocy. Dobrze jednak, że były jaja. Jaja\npozwalały przetrwać najgorsze.</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">* * *</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tNie\nkażdy mógł sobie tak dobrze radzić jak ta córka właściciela\ndużej placówki nauki jazdy rydwanem. Rodzice nie byli zadowoleni.\nPasje Mal owocowały słabymi wynikami w nauce. Okazało się też,\nże jest nadpobudliwy, później nazywano to ADHD. Oznaczało to\nwięcej uwag i nagannych z odpytywania. Wtedy już ławki w szkole\npokrywały się wyszukanymi rysunkami fantastycznych postaci i\nmiejsc. Woźne każdego dnia po zajęciach skrupulatnie czyściły\nławki aby dzieci mogły spokojnie korzystać z edukacji. \n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tNa\njednej z przerw podleciała do niego koleżanka, zapytała, „czy\nkop w krocze naprawdę tak mocno boli?”. Mal przytaknął.\nOdleciała do swoich koleżanek, wróciła i powiedziała\n„Faktycznie! Sprawdziłam, boli jak cholera!”. Polubili się. I\nlubili się. Miała na imię Nat.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tW\nszóstej klasie wraz z przyjacielem krążyli wokół swojego\napartamentowca. Mal dowiedział się od Mat, że Nat i Mar były u\nniego w mieszkaniu z kilkoma starszymi kolegami. Odbyła się tam\npartia rozbieranego pokera. Było to dość szokujące. Miało to\nmiejsce pod koniec ostatniego roku podstawówki. Ostatniego dnia\npodstawówki Mal i Or wypili pierwsze w ich życiu piwo. Potem zjedli\npizzę. Oświetlało ich słońce, spędzili trochę czasu z\nrówieśnikami i ogólnie było super.\n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tW\nwakacje zaczął grać Megica. Gracz z którym się zadawał nauczył\ngo podstaw rozgrywki. Mal znał angielski wystarczająco dobrze aby\nzrozumieć tę grę. Jednego dnia wakacji Pav powiedział, że\nchciałby spróbować razem marihuany. Mal zgodził się, następnego\ndnia palili już ze starszymi kolegami, na terenie budynku szkoły.\nZjarali się jak świnie. Po wakacjach czyhało już gimnazjum. Gdzie\nstracił poczytalność. \n</p>\n</body>\n</html>\n",
  "layout": "default.njk",
  "tags": ["post","Opowiadanie"],
  "title": "6 lat (PL)"
}
