{
  "date": "2023-06-14T07:41:00.000Z",
  "excerpt": "A story.",
  "html": "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\">\n<html>\n<head>\n\t<meta http-equiv=\"content-type\" content=\"text/html; charset=windows-1250\"/>\n\t<title></title>\n\t<meta name=\"generator\" content=\"LibreOffice 6.1.0.3 (Windows)\"/>\n\t<meta name=\"created\" content=\"2016-08-08T21:48:28.379448969\"/>\n\t<meta name=\"changed\" content=\"2017-12-28T14:58:51.395000000\"/>\n\t<style type=\"text/css\">\n\t\t@page { size: 21cm 29.7cm; margin: 2cm }\n\t\tp { margin-bottom: 0.25cm; line-height: 120%; background: transparent }\n\t</style>\n</head>\n<body lang=\"pl-PL\" link=\"#000080\" vlink=\"#800000\" dir=\"ltr\"><p align=\"center\" style=\"margin-bottom: 0cm; line-height: 100%\">\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">\nMirosław Leśniak</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">6\nyears</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tDespair\ngushing with tears. That was the first reaction of Mal to initial day\nof school. It was bringing pity on the faces of adults. After first\ncries Mal started experiencing education with no emotion. Coming back\nhome, supper, television, hygiene, sleep. \n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tAnother\nday came. Mal went to school in companion of freshly met co-students.\nThey talked a bit and the classes started. During one of the class\nbreaks a few guys flew to him. Mal wasn’t able to understand why\nhad they kicked him in the crotch while yelling vulgar insults. He\nnever complained about that.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tEnd of\nthe classes. Mal spread his wings and along with other boys they went\nin direction of their homes. This time they had heavy bags full of\nbooks with them. He’ll never get used to that. Firs homework under\nsupervision of his parents. Supper, TV, hygiene, sleep.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tFirst\nfree of school weekend. With passion he was building all kinds of\nconstructions using Logo, was reading improper humor magazines , comic books, daub\ncomputer game press and painting. Music with silence alternately\nreigned his sister's room. His brother was in army.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">* * *</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tVanilla\nhomogenized cheese and a fresh roll. Best breakfast ever. In addition\nto that, a mug of fresh coco. Mom always made sure that kids are\nprepared for school. She worked herself in another schooling place.\nDad was trading chariot parts all days long. \n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tWinter\ncame, morning flights to school were being performed in the dark.\nComing backs had no sun shining neither. This time it was a bit\ndifferent at home. Mom wasn’t home but there was dad and one of his\nfriends. They were talking, unknown what about. Dad told Mal to go to\nhis room then poured something from a bottle. Mal started taking care\nof his business in his room. Playing, reading and homework.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tThe\nhomework. He hated it. They were forcing him to do it. It was\ndragging him away from the things he loved. He learned fast to cheat\non ones who were forcing him to do it. He did everything possible to\nnot get into the schoolbooks. They were taking that precious time\nleft after school.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tSchool\nwasn’t all bad, it turned out that despite few bullies it was\npossible to have fun. Unfortunately, the consequence was disapproval\nof red teachers who, within range of penalty were making complains\nabout Mal, or, asked questions resulting with F. After all there\nshould be law and order in school so kids can learn.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">* * *</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tIt was\nyear AD1995. All that happened before was still happening but in a\nmore advanced form. On Friday 13<sup>th</sup>, Mal landed on the\nporch of his home. He opened the door to his apartment, entered his\nroom, thrown the heavy bag on the floor. He got shocked. He noticed\nthat there are computer components laying on his desk. That released\nexcitement. He had no clue how to turn it on, however, a friend of\nhis had a computer for a longer time and knew an IT guy. Mal asked\nhis father to call him. That one-eyed pest shown up at his home that\nevening.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tThe\none-eyed locked himself alone in Mal’s room for two hours and told\nto not disturb. After that time the computer was working, DOOS and\nWinblows 3.11 were operational. The pest told dad to pay for the\nservice and the games then vanished in the dark of the night.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tPuntium\n75. 8MB RAM, 1GB drive, 1.44MB floppy station and a SVGA card. No\nsound card nor CD-ROM at that point. Every time he entered invalid\ncommand the system was replying with “what are you doing, idiot”.\nLovely. At least quite interesting games appeared over there in a\nmagical way.<br/>\n<br/>\n</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">* * *</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">No one\ncame up with an idea to teach Mal, lets say, coding. It was school\nthat was supposed to teach stuff and it had no IT class. IT was being\ntold on the streets. They were flying from the apartment to\napartment. Everyone held a box of floppies in their hands. Software\ncalled “RAR” allowed splitting compressed files into floppies, in\nits lovely, blue interface. Thanks to that there were games to play.\nDom, Wurcraft 2. Moortal Koombat 2 were some of the popular ones.\nWarms+ also was OK. Mal played at home whenever he was able to. He\nplayed and played. Usually alone. Because meetings with buddies\noutside usually meant some forms of violence. Good there was fun tho.\nFun was helping surviving the worst. \n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\">* * *</p>\n<p align=\"center\" style=\"line-height: 100%; margin-bottom: 0cm\"><br/>\n</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\t</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tNot\neveryone was able to get as good grades as the daughter of a big\nchariot driving school. Parents were not happy. Passions of Mal\nresulted in low effects in education. It turned out he’s\noverstimulated, later on they started calling this condition “ADD”.\nThat meant more complains and Fs. At that point the school desks\nstarted being covered with sophisticated drawings of fantastic\ncharacters and places. Janitors every day after school carefully\ncleaned the desks so the students can peacefully use education.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tDuring\none of the class beaks one of the female friends flew over and asked\n“Does a nut shot really hurts that much”. Mal confirmed. She flew\nto her friends, came back and said “I checked! Hurts like hell!”.\nThey started liking each other. And they kept on liking each other.\nHer name was Nat.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tDuring\nthe 6<sup>th</sup> year they were flying around their apartment\nbuilding. Mal got informed that that Mar and were at Mat’s\napartment with older friends. They played strip poker then. It turned\nout a bit shocking to Mal. That happened at the end of 6<sup>th</sup>\nschool year of the elementary school. Last day of the last semester\nMal and Or had their first beer in life, had some pizza. Sun was\nshining upon them, they spent some time with friends and generally it\nwas fun.</p>\n<p align=\"left\" style=\"line-height: 100%; margin-bottom: 0cm\">\tOn the\nsummer break he started playing Megic. The player he hanged around\nwith told him the basics of the game play. Mal knew english good\nenough to understand that game. One day of the vacations Pav told\nthat he would like to try marijuana with him. Mal agreed, the next\nday they smoked grass with older friends in the school area. They got\nbaked like pigs. Junior high was already lurking after the vacations.\nHe lost his sanity over there.</p>\n</body>\n</html>\n",
  "layout": "default.njk",
  "tags": ["post","Opowiadanie"],
  "title": "6 years"
}
