{
  "date": "2016-08-20T12:00:00.000Z",
  "excerpt": "What's it take to turn a create-react-app project into a Progressive Web App?",
  "html": "<h1>tl;dr</h1>\n<p>If you'd like to turn the output of <a href=\"https://github.com/facebookincubator/create-react-app\"><code>create-react-app</code></a> into a <a href=\"https://developers.google.com/web/progressive-web-apps/\">progressive web app</a> (PWA) with offline support, take a look at the <a href=\"https://github.com/jeffposnick/create-react-pwa\"><code>create-react-pwa</code></a> repo, and in particular, the <a href=\"https://github.com/jeffposnick/create-react-pwa/compare/starting-point...pwa\">GitHub diff</a> of the minimal changes required.</p>\n<h1>create-react-app...</h1>\n<p><a href=\"https://facebook.github.io/react/blog/2016/07/22/create-apps-with-no-configuration.html\"><code>create-react-app</code></a> solves a problem that many folks (including I) have run into: how can you get started with a straightforward, client-rendered, single page React app and build process, without spending hours researching a list of (sometimes conflicting) dependencies to list in your <code>package.json</code>? It's a project that came out of Facebook's React engineering a few months back, and has since gained some significant mindshare in the web developer community.</p>\n<h1>...and it's limitations</h1>\n<p>In keeping with the fewer-depencies-are-better-dependencies philosophy behind <code>create-react-app</code>, the maintainers <a href=\"https://github.com/facebookincubator/create-react-app/issues/192\">appear to be vigilant</a> in the fight against scope creep, and are keeping the project lean. That's understandable, and it's left up to end users to decide what additional functionality to layer on top of the project's skeleton.</p>\n<p>By design, the core of the build process isn't directly extensible. It's kicked off by <code>npm run build</code> and consists of</p>\n<pre><code>&quot;scripts&quot;: {\n  &quot;build&quot;: &quot;react-scripts build&quot;\n}\n</code></pre>\n<p>But! The opportunity's there to cleanly chain some additional commands after that initial <code>react-scripts build</code>, while keeping the <code>react-scripts</code> black box opaque, giving us the chance to modify the output of the original build process.</p>\n<h1>An Opportunity for PWA-ification</h1>\n<p>That gets to the heart of my investigation: what's the easiest way to guide developers starting from a fresh <code>create-react-app</code> towards the end goal of deploying a <a href=\"https://developers.google.com/web/progressive-web-apps/\">progressive web app</a>? Specifically, what would it take to add in a <a href=\"https://developers.google.com/web/fundamentals/primers/service-worker/\">service worker</a> that provided performance benefits as well as a meaningful offline experience, as well as a <a href=\"https://developers.google.com/web/updates/2014/11/Support-for-installable-web-apps-with-webapp-manifest-in-chrome-38-for-Android\">web app manifest</a> that contained application metadata?</p>\n<h2>Adding a Web App Manifest</h2>\n<p>This is just a <a href=\"https://developer.mozilla.org/en-US/docs/Web/Manifest\">standard</a> JSON file with fields containing metadata useful for controlling the &quot;add to homescreen&quot; experience (currently only on Android devices). While each developer needs to choose their metadata wisely, there's nothing particularly challenging here from a technical perspective, and we just need to create the file and get it copied over to the <code>build/</code> output directory as part of the <code>npm run build</code> process.</p>\n<h2>Adding a Service Worker</h2>\n<p>To handle the service worker, I (not surprisingly) turned to the <a href=\"https://github.com/GoogleChrome/sw-precache\"><code>sw-precache</code></a> project. When added to a build process, it generates a service worker JavaScript file that will automatically version and keep all local static files—HTML, JavaScript, CSS, images, etc.—up to date. Because <em>all</em> of the <code>create-react-app</code> output is local static files (there's no server-side rendering or remote API calls by default, for example), <code>sw-precache</code> can handle everything we need with little configuration needed.</p>\n<p>While I've traditionally used <code>sw-precache</code> as a JavaScript module inside of a <a href=\"http://gulpjs.com/\"><code>gulp</code> build</a> process, it also sports a <a href=\"https://github.com/GoogleChrome/sw-precache#command-line-interface\">command-line interface</a>, and it's simple to add in the <code>sw-precache</code> command to the end of the <code>npm run build</code> script chain.</p>\n<h2>The User Experience</h2>\n<p>Here's what the deployed PWA looks like on Chrome for Android, going through the steps of accepting the Add to Homescreen banner, and then launching it without a network connection.</p>\n<iframe class=\"youtube-embed\" src=\"https://www.youtube.com/embed/nV8sKoVbD5Q?rel=0\" frameborder=\"0\" allowfullscreen></iframe>\n<h1>Try it Yourself</h1>\n<p>The best way to visualize the changes to the build process, as well as the (small) modifications needed to the source code, is to view the <a href=\"https://github.com/jeffposnick/create-react-pwa/compare/starting-point...pwa\">GitHub diff</a> between the starting point and the &quot;final&quot; PWA.</p>\n<p>Take &quot;final&quot; with a grain of salt, because while you will end up with a build process that yields a progressive web app, there are many directions you might want to take the starter project, and some of those might entail a more complex service worker implementation. I've tried to cover <a href=\"https://github.com/jeffposnick/create-react-pwa#what-additional-changes-might-be-needed\">some scenarios</a> in the repo's README, including <a href=\"https://github.com/jeffposnick/create-react-pwa#ive-added-in-react-router-and-now-my-urls-dont-work-offline\">steps to take</a> if you're using <code>react-router</code> and need arbitrary URLs to work offline, as well as how you can add in <a href=\"https://github.com/jeffposnick/create-react-pwa#im-using-cross-origin-apis-or-resources-and-they-arent-working-while-offline\">runtime caching strategies</a> for calls to third party APIs and resources.</p>\n<h1>Beyond create-react-app</h1>\n<p>If you're looking for examples of PWAs build with React that go a bit beyond what  <code>create-react-app</code> offers—for instance, that take advantage of server-side rendering or are built on third-party APIs—there are a few examples I could recommend:</p>\n<ul>\n<li><a href=\"https://github.com/GoogleChrome/sw-precache/tree/master/app-shell-demo\">iFixit PWA</a> (<a href=\"https://ifixit-pwa.appspot.com/\">live deployment</a>)</li>\n<li><a href=\"https://github.com/insin/react-hn\">Hacker News PWA</a> (<a href=\"https://react-hn.appspot.com/\">live deployment</a>)</li>\n</ul>\n",
  "layout": "default.njk",
  "tags": ["post","pwa","react","service-worker","sw"],
  "title": "create-react-pwa"
}
