{
  "date": "2014-11-28T13:34:34.000Z",
  "excerpt": "A step-by-step guide to hosting a blog on HTTPS-enabled custom domain.",
  "html": "<h1>Blogging Software</h1>\n<p>I decided to go with <a href=\"http://jekyllrb.com/\">Jekyll</a>, which ships templates for blog posts, but makes it simple enough to put together standalone pages.</p>\n<h1>Web Hosting</h1>\n<p><a href=\"https://help.github.com/categories/github-pages-basics/\">GitHub Pages</a> is free, which is nice, and (obviously) has first-class support for version control.\nGitHub Pages <a href=\"https://help.github.com/articles/using-jekyll-with-pages/\">natively supports Jekyll</a>, which means I just need to add the raw material to source control, and the <code>_site</code> content will be automatically generated.\nIf you don't care about a custom domain then you can stop at this point—you can serve your site off of https://<em>youraccount</em>.github.io. No effort required for HTTPS support!\n<a href=\"https://github.com/jeffposnick/jeffposnick.github.io\">jeffposnick.github.io</a> is the GitHub repo with this site's content, if you want to check out what's going on under the hood.</p>\n<h1>Registering the Domain</h1>\n<p>I registered &quot;jeffy.info&quot; using <a href=\"https://domains.google.com\">Google Domains</a>.\nGoogle Domains is in invite-only beta mode at the moment, but using an alternative domain registrar shouldn't change the process much.\n(I was surprised at how easy it was to get a <code>.info</code> domain—for whatever reason, they don't seem to be very popular. Check them out rather than settling for some obscure <code>.com</code>.)</p>\n<h1>Add a <code>CNAME</code> file to GitHub</h1>\n<p>As per the <a href=\"https://help.github.com/articles/adding-a-cname-file-to-your-repository/\">instructions</a>, I added a <a href=\"https://github.com/jeffposnick/jeffposnick.github.io/blob/master/CNAME\"><code>CNAME</code> file</a> to the top-level of the repo and pushed to GitHub.</p>\n<h1>CloudFlare Setup</h1>\n<p>This was my first time using CloudFlare, so I needed to set up a (free) account.\nI told CloudFlare that I wanted it to take control over the &quot;jeffy.info&quot; domain, and I set up two <code>A</code> records for the bare (&quot;apex&quot;) domain &quot;jeffy.info&quot; to resolve to the <a href=\"https://help.github.com/articles/tips-for-configuring-an-a-record-with-your-dns-provider/\">two published IP addresses</a> for GitHub's servers.\nI also set up a <code>CNAME</code> record for &quot;www&quot; as an alias of &quot;jeffposnick.github.io&quot;, so that &quot;www.jeffy.info&quot; will resolve.</p>\n<p><img src=\"/assets/images/cloudflare_dns_settings.png\" alt=\"CloudFlare settings screenshot\"></p>\n<h1>Changing the Google Domains DNS Settings</h1>\n<p>In order for CloudFlare to start serving traffic for &quot;jeffy.info&quot;, I needed to change the authoritative DNS settings for the domain to point to CloudFlare's severs.\nThis was straight forward with the Google Domains UI (refer to your registrar's online help if you're using something else):</p>\n<p><img src=\"/assets/images/google_domains_custom_dns.png\" alt=\"Google Domains custom DNS settings\"></p>\n<h1>HTTPS-only Setup</h1>\n<p>CloudFlare auto-provisioned a certificate for &quot;jeffy.info&quot; withing a couple of minutes, which was awesome and as painless as promised.\nMake sure you use the &quot;Flexible SSL&quot; option, which is required to work with a GitHub Pages backend server.\nUsing &quot;Flexible SSL&quot; means that the GitHub Pages ⇔ CloudFlare traffic isn't encrypted, but the CloudFlare ⇔ user's browser traffic is.\nThat's sufficient for my goal of enabling web functionality that requires HTTPS to the end user's browser, but it's probably not a good idea if you're concerned about traffic vulnerabilities in the GitHub Pages ⇔ CloudFlare hop.\nI want to make sure that my blog is HTTPS-only, and <a href=\"https://support.cloudflare.com/hc/en-us/sections/200038236-Page-Rules\">CloudFlare's page rules</a> interface allowed me to set that up:</p>\n<p><img src=\"/assets/images/cloudflare_page_rules.png\" alt=\"HTTPS-only via CloudFlare's page rules\"></p>\n<h1>Optimizing Content</h1>\n<p>Since CloudFlare is a full-fledged CDN, they offer a number of content optimization options. In general, I turned off most of the settings, but I did enable HTML + JS + CSS minification:</p>\n<p><img src=\"/assets/images/cloudflare_auto_minify.png\" alt=\"CloudFlare's web optimization settings\"></p>\n<p>Since I'm relying on GitHub Pages to do my Jekyll's <code>_site</code> build, it seemed easiest to just let CloudFlare handle the minification rather than trying to work out a scripted solution.</p>\n<p>CloudFlare offers image minification as well, but only as part of their paid offering. So I'm using <a href=\"https://www.npmjs.org/package/gulp-imagemin\"><code>gulp-imagemin</code></a> locally on all my images, and pointing to the minified versions in posts. Be sure to minify your images!</p>\n<h1>Future Tweaks</h1>\n<p>I'm not particularly happy with the default Jekyll templates, and have already made a few changes.\nI'm sure there will be lots of twiddling with that to come.\nI'm also not particularly familiar with the best practices for a build workflow. I've got a basic <a href=\"https://github.com/jeffposnick/jeffposnick.github.io/blob/master/gulpfile.js\"><code>gulpfile.js</code></a> that I'm sure will grow over time.</p>\n",
  "layout": "default.njk",
  "tags": ["cloudflare","gh-pages","github","hosting","https","meta","post"],
  "title": "Hosting Setup"
}
