{
  "date": "2023-06-26T20:07:00.000Z",
  "excerpt": "My manifesto",
  "html": "<!DOCTYPE HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\">\n<html>\n<head>\n\t<meta http-equiv=\"content-type\" content=\"text/html; charset=windows-1250\"/>\n\t<title></title>\n\t<meta name=\"generator\" content=\"LibreOffice 6.1.0.3 (Windows)\"/>\n\t<meta name=\"created\" content=\"2016-08-08T21:48:28.379448969\"/>\n\t<meta name=\"changed\" content=\"2017-12-28T14:58:51.395000000\"/>\n\t<style type=\"text/css\">\n\t\t@page { size: 21cm 29.7cm; margin: 2cm }\n\t\tp { margin-bottom: 0.25cm; line-height: 120%; background: transparent }\n\t</style>\n</head>\n<body lang=\"pl-PL\" link=\"#000080\" vlink=\"#800000\" dir=\"ltr\"><p align=\"center\" style=\"margin-bottom: 0cm; line-height: 100%\">\n<p><span lang=\"en-US\">See a vital lineage will never leave you alone\nwith the trouble you got. Well lineages are large, organized\nfamilies. They care about blood, wealth, heath, education, reputation\nof the power of the lineage. They do all they can to improve the\nlineage. Being a member of the lineage is beneficial, you have a lot\nof support from often rich and powerful people. </span><span lang=\"en-US\">Lineages\nhave their rules, codex and leadership. </span><span lang=\"en-US\">It\ndoes not take much to start a lineage. But, it takes a lot of time to\nmake the lineage big. Often few hundreds of years. Through that time\nyou constantly have to prove and improve your lineage so it shows up\nan as glorious through the history. They keep track of all the people\nthey got, what they did, when they were born, died, etc. And by\nstarting a lineage you get the founder status, you will be remembered\nas the founder of the lineage, as a great person. Lineages arrange\nmarriage for young grown ups so everyone gets married in a good\nfamily. Dowry for a young woman is a great way to arrange them, every\nlineage wants their women to be married in good and wealthy families.\nA good lineage will never leave you alone to die if they are able\nhelp. And it all starts with considering the general prosperity of\nyour family is most important, when you realize you can make the name\nmean something. So yeah families values are a good virtue to have.\nVery good if you're conscious you're in a family and you should\ntogether with the family for mutual benefit. No we should make a lot\nof lineages. After 200 years it will be clear who takes the prime,\nwho's the largest, strongest, most noble, smartest lineage of all\nlineages. And this lineage will take power in their hands. </span><span lang=\"en-US\">F</span><span lang=\"en-US\">rom\nthe prime lineage there will be king chosen, the leader of the prime\nlineage. Head of all<span lang=\"en-US\">See a vital lineage will never leave you alone families in the nation. And everyone in the\nnation will say &quot;hail to the king&quot;. </span><span lang=\"en-US\">K</span><span lang=\"en-US\">ing\ncould be a good guy. Like, I could go to the king if they let me and\nas him: &quot;sire, i appreciate all of your magnificent country but\nwe're a small group of Muslims and we can't afford to build a little\nmosque, could you build one for us?&quot;. And if king likes me and\nthe idea he just gives an order. </span><span lang=\"en-US\">A</span><span lang=\"en-US\">nd\nthey start building the mosque. So yea I'm big fan of lineage based\nsocieties. </span><span lang=\"en-US\">K</span><span lang=\"en-US\">nowledge\nis very important in lineages. Like you learn stuff in a school\nlineage picks up. </span><span lang=\"en-US\">B</span><span lang=\"en-US\">ut\nyou also carry knowledge about lineage itself. Generation after\ngeneration. </span><span lang=\"en-US\">A</span><span lang=\"en-US\">nd\nover time your lineage gets better and better. Like there are larger\nfamilies helping each other but only in a formal lineage you can\norganize your family on a large scale and survive for long. And this\nmakes things more clear, a situation when a distant member of the\nfamily rejects you can't happen. So anyway, those are wise families\noriented to long term survival which is a virtue. </span><span lang=\"en-US\">E</span><span lang=\"en-US\">lders\nlive their late life with dignity. Kids get the best education\npossible. </span><span lang=\"en-US\">Th</span><span lang=\"en-US\">e\nblood improves. You can live in New York and have lineage members all\nover </span><span lang=\"en-US\">your</span><span lang=\"en-US\">\ncountry, like in San Francisco or Chicago. So there is always someone\nto hang around with when you travel. </span><span lang=\"en-US\">A</span>fter\nlineage grows you can have relatives in all kinds of places,\nmilitary, medicine, corporations, police, cinematography, everywhere!\nLineages are pure good, start one now!</p></p>\n</body>\n</html>\n",
  "layout": "default.njk",
  "tags": ["post","Opowiadanie"],
  "title": "Lineage"
}
