{
  "date": "2018-09-30T22:00:00.000Z",
  "excerpt": "Apparently, the whole point of this blog is to blog about blogging architecture.",
  "html": "<h1>Motivation</h1>\n<p>Following up from my &quot;<a href=\"https://developers.google.com/web/updates/2018/05/beyond-spa\">Beyond SPAs: alternative architectures for your PWA</a>&quot; talk at Google I/O this year, I've been investigating ways of bringing all of the benefits folks associate with PWAs (network-independent loading, rich metadata provided by a web app manifest) to a more traditional, &quot;blog-y&quot; site architecture.</p>\n<p><a href=\"https://twitter.com/mathias\">Mathias</a> was visiting NYC last week, and I gave him some advice about the service worker for the relaunched <a href=\"https://v8.dev/\">V8 developer blog</a>. He ended up going with <a href=\"https://www.11ty.io/\">11ty</a> for building the blog, along with <a href=\"https://mozilla.github.io/nunjucks/\">Nunjucks templates</a>. I figured it was worth giving that set of tools a try, and see what migrating my existing, <a href=\"https://jekyllrb.com/\">Jekyll</a> (+ <a href=\"https://shopify.github.io/liquid/\">Liquid templates</a>) blog setup would be.</p>\n<p>And, while I was at it, I wanted to see what it would look like to implement all of the site build + templating infrastructure inside of a service worker, to give a more robust offline-first experience than what Mathias was able to get for the V8 blog. (Just the index page was being cached.)</p>\n<h1>The present</h1>\n<p>I've moved most of the templates over to use Nunjucks, though I believe I've lost a few filters and date formatting options that I had with Liquid.</p>\n<p>Using 11ty instead of Jekyll to orchestrate the build was very straightforward, after moving a few directories around.</p>\n<p>I've created a <a href=\"https://github.com/jeffposnick/jeffposnick.github.io/blob/6d9e5631a2eb9dd5083b1ee18090e890fa128672/generate-sw.js\">helper script</a> to take care of the service worker metadata generation. This basically handles a lot of the same processing that 11ty does as part of a build, but spits out the data in JSON files that could then be cached and read from the service worker using the Cache Storage API.</p>\n<p>The service worker itself, not surprisingly, uses <a href=\"https://developers.google.com/web/tools/workbox/\">Workbox</a> under the hood for precaching and runtime caching, with a custom <a href=\"https://developers.google.com/web/tools/workbox/reference-docs/latest/workbox.routing.Route#~handlerCallback\"><code>handlerCallback</code></a> to trigger the Nunjucks rendering.</p>\n<p>Nunjucks rendering worked very well—there's an official build of Nunjucks which runs in the <a href=\"https://mozilla.github.io/nunjucks/api.html#browser-usage\">browser</a> (including in a service worker), and that really made it much easier to set this up. I've struggled in the past to implement service worker templating using <a href=\"https://github.com/sirlantis/liquid-node\">libraries</a> that weren't really meant to run in the browser, or did not have <a href=\"https://mozilla.github.io/nunjucks/api.html#writing-a-loader\">pluggable loaders</a> (to pull in templates using the Cache Storage API). Wrapping callback-style asynchronicity with promises meant that everything played nicely. I would love to see if, in the future, Nunjucks could be replaced by something a bit more lightweight—perhaps <a href=\"https://twitter.com/jeffposnick/status/1046093468341276673\">native JavaScript template literals</a>.</p>\n<p>Check out the <a href=\"/service-worker.js\">latest deployed version</a> of this site's service worker if you want to learn more—I'm expecting to clean it up quite a bit as I find some more time. One pretty neat bit worth excerpting is:</p>\n<pre><code class=\"language-js\">const postHandler = async ({params}) =&gt; {\n  const site = await initSiteData();\n  const cachedResponse = await caches.match(`/_posts/${params.join('-')}.json`, {\n    cacheName: workbox.core.cacheNames.precache,\n  });\n  const context = await cachedResponse.json();\n  context.site = site;\n  context.content = context.html;\n  const html = await new Promise((resolve, reject) =&gt; {\n    nunjucksEnv.render(context.layout, context, (error, html) =&gt; {\n      if (error) {\n        return reject(error);\n      }\n      return resolve(html);\n    });\n  });\n  const headers = {'content-type': 'text/html'};\n  return new Response(html, {headers});\n};\n\nworkbox.routing.registerRoute(\n  new RegExp('/(\\\\d{4})/(\\\\d{2})/(\\\\d{2})/(.+)\\\\.html'),\n  postHandler\n);\n</code></pre>\n<h1>Caching strategies</h1>\n<p>All of the site metadata, templates and content (a whole 8 blog posts!) are precached, which adds up to only ~77kb for my blog. If I were working on a larger site, I'd consider only precaching the site metadata and templates, and using a runtime caching strategy for the posts' JSON.</p>\n<p>I've got a cache-first strategy set up for the few images that I use on this blog.</p>\n<p>After the service worker's installed, subsequent navigations should be fulfilled entirely from the cache, making the site work fully offline and, more importantly, load reliably fast. (The fact that it's all just some ugly static HTML and CSS helps with the speed, too.)</p>\n<h1>The future</h1>\n<p>I'd love to get some of the logic that I've put into the custom build scripts into the core of the 11ty project, if that makes sense, or at least packaged up into a standalone set of helpers.</p>\n<p>I need to refactor a bunch of that code to stop hardcoding things like paths, as well as try to support custom 11ty filters and plugins within the service worker.</p>\n<p>As mentioned, I'm still evaluating whether Nunjucks is the right templating engine to use, but its syntax does seem familiar enough for folks coming from Liquid templates, or Jinja.</p>\n<p>The actual service worker code needs to be refactored a bit, and I'd like to make it flexible enough to load any <code>_data</code> you're using, not just the <code>site.json</code>.</p>\n<p>I'm not minimizing anything right now, and the build process is generally a bunch of things stuck together with tap.</p>\n<h1>Alternatives</h1>\n<p>There are a host of other options for folks to consider right now—it's actually a really great time for PWA-y static blogs and site generators. I like what <a href=\"https://www.gatsbyjs.org/\">Gatsby's doing</a>, especially with v2 (featuring  <a href=\"https://www.gatsbyjs.org/packages/gatsby-plugin-offline/\">Workbox-powered offline support</a>). <a href=\"https://vuepress.vuejs.org/\">Vuepress</a> is similarly vue-pressive, and features Workbox integration as well.</p>\n<p>But if you're not interested in building your site's structure using React or Vue, and are coming from a more Jekyll-y starting point, I'm kind of excited about the approach I'm using here.</p>\n",
  "layout": "default.njk",
  "tags": ["11ty","meta","nunjucks","post","web","workbox"],
  "title": "Something Brewing"
}
